#+TITLE: Sunbird RC - Health Facilities Registry Demo
#+AUTHOR:
#+DATE: 2025-12-10
#+PROPERTY: header-args:python :session *sunbird-health* :results output :exports both
#+STARTUP: overview indent

* Setup

#+NAME: setup
#+begin_src python
import requests
import json
import pandas as pd
from datetime import datetime

# Configuration
BASE_URL = "http://localhost:8081/api/v1"
SCHEMA_URL = "http://localhost:8081/api/docs/swagger.json"
HEADERS = {"Content-Type": "application/json"}

print("✅ Health Facilities Registry - Setup complete!")
print(f"Registry API: {BASE_URL}")
#+end_src

#+RESULTS: setup
: ✅ Health Facilities Registry - Setup complete!
: Registry API: http://localhost:8081/api/v1

* 1. Check Registry Health

#+NAME: check-health
#+begin_src python
response = requests.get("http://localhost:8081/health")
health = response.json()

print(f"Status: {health['result']['healthy']}")
print(f"Service: {health['result']['name']}")
print("\nRegistry is ready!")
#+end_src

#+RESULTS: check-health
: Status: True
: Service: sunbirdrc-registry-api
:
: Registry is ready!

** Understanding Schema Location

Sunbird RC schemas are defined in configuration files. Let's check where schemas should be added:

#+NAME: check-schema-location
#+begin_src python
import os

# Common schema locations in Sunbird RC
schema_paths = [
    "./java/registry/src/main/resources/public/_schemas",
    "./schemas",
    "../schemas"
]

print("Schema Configuration in Sunbird RC:")
print("=" * 80)
print("\nSchemas are typically stored in:")
print("  - java/registry/src/main/resources/public/_schemas/")
print("\nWe need to create a HealthFacility.json schema file.")
print("\nLet's create the schema definition...")
#+end_src

#+RESULTS: check-schema-location
: Schema Configuration in Sunbird RC:
: ================================================================================
:
: Schemas are typically stored in:
:   - java/registry/src/main/resources/public/_schemas/
:
: We need to create a HealthFacility.json schema file.
:
: Let's create the schema definition...

** Create HealthFacility Schema File

#+NAME: create-schema-definition
#+begin_src python
# Define the HealthFacility schema (matching Sunbird RC structure)
health_facility_schema = {
    "$schema": "http://json-schema.org/draft-07/schema",
    "type": "object",
    "properties": {
        "HealthFacility": {
            "$ref": "#/definitions/HealthFacility"
        }
    },
    "required": ["HealthFacility"],
    "title": "HealthFacility",
    "definitions": {
        "HealthFacility": {
            "$id": "#/properties/HealthFacility",
            "type": "object",
            "title": "Health Facility Registry",
            "description": "Schema for health facilities including hospitals, clinics, and diagnostic centers",
            "required": ["facilityName", "registrationNumber", "facilityType", "directorName"],
            "properties": {
                "facilityName": {
                    "type": "string",
                    "description": "Name of the health facility"
                },
                "registrationNumber": {
                    "type": "string",
                    "description": "Unique registration number"
                },
                "facilityType": {
                    "type": "string",
                    "enum": ["Government", "Private", "NGO"],
                    "description": "Type of facility ownership"
                },
                "subType": {
                    "type": "string",
                    "description": "Specific type of health facility (e.g., Hospital, Clinic, Diagnostic Center)"
                },
                "directorName": {
                    "type": "string",
                    "description": "Name of the facility director"
                },
                "directorQualification": {
                    "type": "string",
                    "description": "Qualifications of the director"
                },
                "numberOfOfficers": {
                    "type": "integer",
                    "minimum": 0,
                    "description": "Number of administrative officers"
                },
                "numberOfDoctors": {
                    "type": "integer",
                    "minimum": 0,
                    "description": "Number of doctors"
                },
                "numberOfNurses": {
                    "type": "integer",
                    "minimum": 0,
                    "description": "Number of nurses"
                },
                "numberOfBeds": {
                    "type": "integer",
                    "minimum": 0,
                    "description": "Total bed capacity"
                },
                "hasEmergency": {
                    "type": "boolean",
                    "description": "Whether facility has emergency services"
                },
                "hasICU": {
                    "type": "boolean",
                    "description": "Whether facility has ICU"
                },
                "icuBeds": {
                    "type": "integer",
                    "minimum": 0,
                    "description": "Number of ICU beds"
                },
                "specializations": {
                    "type": "array",
                    "items": {
                        "type": "string"
                    },
                    "description": "Medical specializations available"
                },
                "services": {
                    "type": "array",
                    "items": {
                        "type": "string"
                    },
                    "description": "Services offered"
                },
                "address": {
                    "type": "object",
                    "properties": {
                        "street": {"type": "string"},
                        "city": {"type": "string"},
                        "state": {"type": "string"},
                        "postalCode": {"type": "string"},
                        "country": {"type": "string"}
                    }
                },
                "contactPhone": {
                    "type": "string",
                    "description": "Primary contact phone number"
                },
                "contactEmail": {
                    "type": "string",
                    "format": "email",
                    "description": "Primary contact email"
                },
                "establishedYear": {
                    "type": "integer",
                    "minimum": 1800,
                    "maximum": 2100,
                    "description": "Year the facility was established"
                },
                "accreditation": {
                    "type": "string",
                    "description": "Accreditation status (e.g., NABH, JCI)"
                },
                "operatingHours": {
                    "type": "string",
                    "description": "Operating hours of the facility"
                },
                "website": {
                    "type": "string",
                    "format": "uri",
                    "description": "Website URL"
                }
            }
        }
    },
    "_osConfig": {
        "privateFields": [],
        "signedFields": [],
        "indexFields": ["registrationNumber", "facilityType", "city", "state"],
        "uniqueIndexFields": ["registrationNumber"],
        "systemFields": ["osCreatedAt", "osUpdatedAt", "osCreatedBy", "osUpdatedBy"],
        "roles": ["admin"],
        "inviteRoles": ["anonymous"],
        "ownershipAttributes": []
    }
}

# Save schema to file
schema_filename = "HealthFacility.json"
with open(schema_filename, 'w') as f:
    json.dump(health_facility_schema, f, indent=2)

print("✅ HealthFacility schema definition created!")
print(f"Schema file: {schema_filename}")
print("\nSchema Structure:")
print("=" * 80)
print(json.dumps(health_facility_schema, indent=2))
#+end_src

#+RESULTS: create-schema-definition
#+begin_example
✅ HealthFacility schema definition created!
Schema file: HealthFacility.json

Schema Structure:
================================================================================
{
  "$schema": "http://json-schema.org/draft-07/schema",
  "type": "object",
  "properties": {
    "HealthFacility": {
      "type": "object",
      "required": [
        "facilityName",
        "registrationNumber",
        "facilityType",
        "directorName"
      ],
      "properties": {
        "facilityName": {
          "type": "string",
          "description": "Name of the health facility"
        },
        "registrationNumber": {
          "type": "string",
          "description": "Unique registration number"
        },
        "facilityType": {
          "type": "string",
          "enum": [
            "Government",
            "Private",
            "NGO"
          ],
          "description": "Type of facility ownership"
        },
        "subType": {
          "type": "string",
          "description": "Specific type of health facility (e.g., Hospital, Clinic, Diagnostic Center)"
        },
        "directorName": {
          "type": "string",
          "description": "Name of the facility director"
        },
        "directorQualification": {
          "type": "string",
          "description": "Qualifications of the director"
        },
        "numberOfOfficers": {
          "type": "integer",
          "minimum": 0,
          "description": "Number of administrative officers"
        },
        "numberOfDoctors": {
          "type": "integer",
          "minimum": 0,
          "description": "Number of doctors"
        },
        "numberOfNurses": {
          "type": "integer",
          "minimum": 0,
          "description": "Number of nurses"
        },
        "numberOfBeds": {
          "type": "integer",
          "minimum": 0,
          "description": "Total bed capacity"
        },
        "hasEmergency": {
          "type": "boolean",
          "description": "Whether facility has emergency services"
        },
        "hasICU": {
          "type": "boolean",
          "description": "Whether facility has ICU"
        },
        "icuBeds": {
          "type": "integer",
          "minimum": 0,
          "description": "Number of ICU beds"
        },
        "specializations": {
          "type": "array",
          "items": {
            "type": "string"
          },
          "description": "Medical specializations available"
        },
        "services": {
          "type": "array",
          "items": {
            "type": "string"
          },
          "description": "Services offered"
        },
        "address": {
          "type": "object",
          "properties": {
            "street": {
              "type": "string"
            },
            "city": {
              "type": "string"
            },
            "state": {
              "type": "string"
            },
            "postalCode": {
              "type": "string"
            },
            "country": {
              "type": "string"
            }
          }
        },
        "contactPhone": {
          "type": "string",
          "description": "Primary contact phone number"
        },
        "contactEmail": {
          "type": "string",
          "format": "email",
          "description": "Primary contact email"
        },
        "establishedYear": {
          "type": "integer",
          "minimum": 1800,
          "maximum": 2100,
          "description": "Year the facility was established"
        },
        "accreditation": {
          "type": "string",
          "description": "Accreditation status (e.g., NABH, JCI)"
        },
        "operatingHours": {
          "type": "string",
          "description": "Operating hours of the facility"
        },
        "website": {
          "type": "string",
          "format": "uri",
          "description": "Website URL"
        }
      }
    }
  },
  "required": [
    "HealthFacility"
  ]
}
#+end_example

